13xforever.language-x86-64-assembly
arcticicestudio.nord-visual-studio-code
bradlc.vscode-tailwindcss
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons
dan-c-underwood.arm
dansilver.typewriter
docker.docker
donjayamanne.githistory
drcika.apc-extension
exodiusstudios.comment-anchors
foxundermoon.shell-format
ggml-org.llama-vscode
hashicorp.terraform
james-yu.latex-workshop
johnpapa.vscode-peacock
luniclynx.bison
mathiasfrohlich.kotlin
ms-azuretools.vscode-containers
ms-ceintl.vscode-language-pack-fr
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.vscode-serial-monitor
# nvarner.typst-lsp
piousdeer.adwaita-theme
pkief.material-icon-theme
pkief.material-product-icons
plorefice.devicetree
prince781.vala
redhat.vscode-xml
redhat.vscode-yaml
ritwickdey.liveserver
sztheory.vscode-packer-powertools
tboox.xmake-vscode
valentjn.vscode-ltex
vasilescur.better-mips
vscjava.vscode-gradle
vue.volar
wokwi.wokwi-vscode
xaver.clang-format
zhuangtongfa.material-theme
zhwu95.riscv
zixuanwang.linkerscript
